import java.util.*;

public class Main {
	public static void main(String[] args) {
		for (String s:spells) {
			System.out.println(String.format("case \"%s\":\nps=\"未填坑\";\nbreak;", s));
		}
	}
	public static String[] spells=new String[]{
		"月符「月光」",
		"夜符「夜雀」",
		"暗符「境界线」",

		"冰符「冰瀑」",
		"雹符「冰雹暴风」",
		"冻符「完美冻结」",
		"雪符「钻石风暴」",

		"华符「芳华绚烂」",
		"华符「Selaginella 9」",
		"虹符「彩虹风铃」",
		"幻符「华想梦葛」",
		"彩符「彩雨」",
		"彩符「彩光乱舞」",
		"彩符「极彩台风」",

		"火符「火神之光」",
		"水符「水精公主」",
		"木符「风灵的角笛」",
		"土符「慵懒三石塔」",
		"金符「金属疲劳」",
		"火符「火神之光 上级」",
		"木符「风灵的角笛 上级」",
		"土符「慵懒三石塔 上级」",
		"火符「火神之光」",
		"水符「湖葬」",
		"木符「翠绿风暴」",
		"土符「三石塔的震动」",
		"金符「银龙」",
		"火&土符「环状熔岩带」",
		"木&火符「森林大火」",
		"水&木符「水精灵」",
		"金&水符「水银之毒」",
		"土&金符「翡翠巨石」",

		"奇术「误导」",
		"奇术「幻惑误导」",
		"幻在「钟表的残骸」",
		"幻幽「迷幻杰克」",
		"幻象「月神之钟」",
		"幻世「世界」",
		"女仆秘技「操弄玩偶」",
		"女仆秘技「杀人玩偶」",

		"奇术「永恒的温柔」",

		"天罚「大卫之星」",
		"神罚「年幼的恶魔之王」",
		"冥符「红色的冥界」",
		"狱符「千根针的针山」",
		"诅咒「弗拉德·特佩斯的诅咒」",
		"神术「吸血鬼幻想」",
		"红符「绯红射击」",
		"红符「绯红之主」",
		"「Red Magic」",
		"「红色的幻想乡」",		

		"月符「静息的月神」",
		"日符「皇家烈焰」",
		"火水木金土符「贤者之石」",

		"禁忌「红莓陷阱」",
		"禁忌「莱瓦汀」",
		"禁忌「四重存在」",
		"禁忌「笼中鸟」",
		"禁忌「恋之迷宫」",
		"禁弹「星弧破碎」",
		"禁弹「折反射」",
		"禁弹「刻着过去的钟表」",
		"秘弹「之后就一个人都没有了吗？」",
		"QED「495年的波纹」"
	};
}
