import java.util.*;

public class Main {
	public static void main(String[] args) {
		for (String s:spells) {
			System.out.println(String.format("case \"%s\":\nps=\"未填坑\";\nbreak;", s));
		}
		for (String s:lastword) {
			System.out.println(String.format("case \"%s\":\nps=\"未填坑\";\nbreak;", s));
		}
	}
	public static String[] lastword=new String[]{
		"「不合时令的蝶雨」",
		"「失明的夜雀」",
		"「日出之国的天子」",
		"「远古的骗术」",
		"「月的红眼」",
		"「天网蛛网捕蝶之法」",
		"「蓬莱的树海」",
		"「不死鸟重生」",
		"「似有似无的净化」",
		"「梦想天生」",
		"「彗星」",
		"「收缩的世界」",
		"「待宵反射卫星斩」",
		"「猎奇剧团的怪人」",
		"「绯红的宿命」",
		"「西行寺无余涅槃」",
		"「深弹幕结界 梦幻泡影」"
	};
	public static String[] spells=new String[]{
		"萤符「地上的流星」",
		"萤符「地上的彗星」",
		"灯符「萤光现象」",
		"蠢符「小虫」",
		"蠢符「小虫风暴」",
		"蠢符「夜虫风暴」",
		"蠢符「夜虫龙卷」",

		"声符「枭的夜鸣声」",
		"声符「木菟的咆哮」",
		"蛾符「天蛾的蛊道」",
		"毒符「毒蛾的鳞粉」",
		"猛毒「毒蛾的黑暗演舞」",
		"鹰符「祸延疾冲」",
		"夜盲「夜雀之歌」",

		"产灵「最初的金字塔」",
		"始符「短暂的137」",
		"野符「武烈的危机」",
		"野符「将门的危机」",
		"野符「义满的危机」",
		"野符「GHQ的危机」",
		"国符「三种神器 剑」",
		"国符「三种神器 玉」",
		"国符「三种神器 镜」",
		"国体「三种神器 乡」",
		"终符「幻想天皇」",
		"虚史「幻想乡传说」",

		"梦符「二重结界」",
		"梦境「二重大结界」",
		"灵符「梦想封印 散」",
		"散灵「梦想封印 寂」",
		"梦符「封魔阵」",
		"神技「八方鬼缚阵」",
		"神技「八方龙杀阵」",
		"灵符「梦想封印 集」",
		"回灵「梦想封印 侘」",
		"境界「二重弹幕结界」",
		"大结界「博丽弹幕结界」",

		"魔符「银河」",
		"魔空「小行星带」",
		"魔符「星尘幻想」",
		"黑魔「黑洞边缘」",
		"恋符「非定向光线」",
		"恋风「星光台风」",
		"恋符「极限火花」",
		"恋心「二重火花」",
		"光符「地球光」",
		"光击「击月」",

		"波符「赤眼催眠(Mind Shaker)」",
		"幻波「赤眼催眠(Mind Blowing)」",
		"狂符「幻视调律(Visionary Tuning)」",
		"狂视「狂视调律(Illusion Seeker)」",
		"懒符「生神停止(Idling Wave)」",
		"懒惰「生神停止(Mind Stopper)」",
		"散符「真实之月(Invisible Full Moon)」",

		"天丸「壶中的天地」",
		"觉神「神代的记忆」",
		"神符「天人的族谱」",
		"苏活「生命游戏 -Life Game-」",
		"苏生「Rising Game」",
		"操神「思兼装置」",
		"神脑「思兼的头脑」",
		"天咒「阿波罗13」",
		"秘术「天文密葬法」",

		"药符「壶中的大银河」",

		"难题「龙颈之玉 -五色的弹丸-」",
		"神宝「耀眼的龙玉」",
		"难题「佛御石之钵 -不碎的意志-」",
		"神宝「佛体的金刚石」",
		"难题「火鼠的皮衣 -不焦躁的内心-」",
		"神宝「火蜥蜴之盾」",
		"难题「燕的子安贝 -永命线-」",
		"神宝「无限的生命之泉」",
		"难题「蓬莱的弹枝 -七色的弹幕-」",
		"神宝「蓬莱的玉枝 -梦色之乡-」",

		"旧史「旧秘境史 -古代史-」",
		"转世「一条归桥」",
		"新史「新幻想史 -现代史-」",

		"时效「月岩笠的诅咒」",
		"不死「火鸟 -凤翼天翔-」",
		"藤原「灭罪寺院伤」",
		"不死「徐福时空」",
		"灭罪「正直者之死」",
		"虚人「无一」",
		"不灭「不死鸟之尾」",
		"蓬莱「凯风快晴 -Fujiyama Volcano-」",
		"「不死鸟附体」",
		"「蓬莱人形」"
	};
}
