import java.util.*;

public class Main
{
	public static void main(String[] args)
	{
		StringBuilder sb=new StringBuilder();
		for(String s:spells){
			sb.append(String.format(".addSpell(\"%s\",  )\n",s));
		}
		System.out.println(sb.toString());
	}
	public static String[] overdrive = new String[]{
		"樱符「樱吹雪地狱」",
		"山彦「山彦的发挥本领之回音」",
		"毒爪「不死的杀人鬼」",
		"道符「道胎动 ~道~」",
		"怨灵「入鹿之雷」",
		"圣童女「太阳神的贡品」",
		"「神灵大宇宙」",
		"「Wild Carpet」"
	};
	public static String[] spells=new String[]{
		"符牒「死蝶之舞」",
		"符牒「死蝶之舞 -樱花-」",
		"幽蝶「幽魂聚地」",
		"幽蝶「幽魂聚地 -樱花-」",
		"冥符「常夜樱」",
		"樱符「西行樱吹雪」",
		"樱符「樱吹雪地狱」",

		"响符「山谷回声」",
		"响符「混乱的山谷回声」",
		"响符「强力共振」",
		"山彦「远距离回声」",
		"山彦「扩大回声」",
		"大声「激动的呼喊」",
		"大声「激动Yahoo」",
		"山彦「山彦的发挥本领之回音」",

		"虹符「雨伞风暴」",

		"回复「借由欲望的恢复」",
		"毒爪「剧毒抹消」",
		"毒爪「剧毒杀害」",
		"欲符「赚钱欲灵招来」",
		"欲灵「贪分欲吞噬者」",
		"毒爪「不死的杀人鬼」",

		"邪符「养小鬼」",
		"邪符「孤魂野鬼」",
		"入魔「走火入魔」",
		"降灵「死人童乩」",
		"通灵「通灵芳香」",
		"道符「道胎动」",
		"道符「道胎动 ~道~」",

		"雷矢「元兴寺的旋风」",
		"雷矢「元兴寺的龙卷」",
		"怨灵「入鹿之雷」",
		"怨灵「入鹿之雷」",

		"天符「雨之磐舟」",
		"天符「天之磐舟哟，向天飞升吧」",
		"投皿「物部氏的八十平瓮」",
		"炎符「废佛之炎风」",
		"炎符「火烧樱井寺」",
		"圣童女「大物忌正餐」",
		"圣童女「太阳神的贡品」",

		"名誉「十二阶之色彩」",
		"名誉「十二阶之冠位」",
		"仙符「日出之处的道士」",
		"仙符「日出之处的天子」",
		"召唤「豪族乱舞」",
		"秘宝「斑鸠寺的天球仪」",
		"秘宝「圣德太子的欧帕兹」",
		"光符「救世观音的佛光」",
		"光符「救世之光」",
		"眼光「十七条的光芒」",
		"神光「无忤为宗」",
		"「星辰降落的神灵庙」",
		"「新生的神灵」",
		"「神灵大宇宙」",

		"未知「轨道不明的鬼火」",
		"未知「姿态不明的空鱼」",
		"未知「原理不明的妖怪玉」",

		"一回胜负「灵长类弹幕变化」",
		"二回胜负「肉食类弹幕变化」",
		"三回胜负「羽鸟类弹幕变化」",
		"四回胜负「两栖类弹幕变化」",
		"五回胜负「鸟兽戏画」",
		"六回胜负「狸猫的变身学校」",
		"七回胜负「野生的离岛」",
		"变化「魔奴化巫女的伪退治」",
		"「猯藏化弹幕十变化」",
		"貉符「满月下的腹鼓舞」",
		"「Wild Carpet」"
	};
}
