import java.util.*;

public class Main {
	public static void main(String[] args) {
		for (String s:spells) {
			System.out.println(String.format("case \"%s\":\nps=\"暂无\";\nbreak;", s));
		}
	}
	public static String[] spells=new String[]{
		"冰符「Ultimate Blizzard」",

		"水符「尾鳍拍击」",
		"鳞符「鳞之波」",
		"鳞符「逆鳞的惊涛」",
		"鳞符「逆鳞的大惊涛」",

		"飞符「飞行之头」",
		"首符「闭目射击」",
		"首符「辘轳首飞来」",
		"飞头「倍增之头」",
		"飞头「第七个头」",
		"飞头「第九个头」",
		"飞头「杜拉罕之夜」",

		"牙符「月下的犬齿」",
		"变身「三角齿」",
		"变身「星形齿」",
		"咆哮「陌生的咆哮」",
		"咆哮「满月的远吠」",
		"狼符「星环猛扑」",
		"天狼「高速猛扑」",

		"琴符「诸行无常的琴声」",
		"响符「平安的残响」",
		"响符「回音之庭」",
		"筝曲「下克上送筝曲」",
		"筝曲「下克上安魂曲」",

		"平曲「祗园精舍的钟声」",
		"怨灵「无耳芳一」",
		"怨灵「平家的大怨灵」",
		"乐符「邪恶的五线谱」",
		"乐符「凶恶的五线谱」",
		"乐符「Double Score」",

		"欺符「逆针击」",
		"逆符「镜之国的弹幕」",
		"逆符「镜中的邪恶」",
		"逆符「天地有用」",
		"逆符「天下翻覆」",
		"逆弓「天壤梦弓」",
		"逆弓「天壤梦弓的诏敕」",
		"逆转「阶级反转」",
		"逆转「变革空勇士」",

		"小弹「小人的道路」",
		"小弹「小人的荆棘路」",
		"小槌「变大吧」",
		"小槌「变得更大吧」",
		"妖剑「辉针剑」",
		"小槌「你给我变大吧」",
		"「进击的小人」",
		"「一寸之壁」",
		"「七个小拇指」",
		"「七个一寸法师」",	

		"弦乐「风暴的合奏」",
		"弦乐「净琉璃世界」",

		"一鼓「暴乱宫太鼓」",
		"二鼓「怨灵绫鼓」",
		"三鼓「午夜零时的三振」",
		"死鼓「轻敲大地」",
		"五鼓「雷电拨浪鼓」",
		"六鼓「交替打击法」",
		"七鼓「高速和太鼓火箭」",
		"八鼓「雷神之怒」",
		"「蓝色佳人的演出」",
		"「Pristine beat」"
	};
}
