import java.util.*;

public class Main {
	public static void main(String[] args) {
		for (String s:spells) {
			System.out.println(String.format("case \"%s\":\nps=\"未填坑\";\nbreak;", s));
		}
	}
	public static String[] spells=new String[]{
		"蝶符「细碎鳞粉」",
		"蝶符「凤蝶的鳞粉」",
		"蝶符「扑翅之夏」",
		"蝶符「盛夏振翅」",

		"雨符「被囚禁的秋雨」",
		"雨符「被诅咒的柴榑雨」",
		"刃符「山姥的菜刀研磨」",
		"刃符「山姥的鬼菜刀研磨」",
		"尽符「深山谋杀」",
		"尽符「血腥的深山谋杀」",

		"春符「惊喜之春」",

		"犬符「野犬的散步」",
		"狗符「山狗的散步」",
		"陀螺「狛犬回旋」",
		"陀螺「蜷缩死去」",
		"狛符「单人式阿吽的呼吸」",

		"魔符「顷刻菩提」",
		"魔符「即席菩提」",
		"魔符「弹丸魔像」",
		"魔符「作宠物的巨大弹生命体」",
		"地藏「罪业救赎」",
		"地藏「业火救济」",

		"竹符「竹矛之舞」",
		"竹符「竹之狂舞」",
		"笹符「七夕星祭」",

		"茗荷「忘却你的名字」",
		"冥加「在你背后」",

		"舞符「背后之祭」",
		"狂舞「天狗怖吓」",
		"狂舞「狂乱天狗怖吓」",

		"后符「秘神的后光」",
		"后符「绝对秘神的后光」",
		"里夏「暑夏炙烤」",
		"里夏「异常酷暑之焦土」",
		"里秋「死于饥荒」",
		"里秋「异常枯死之饿鬼」",
		"里冬「黑色雪人」",
		"里冬「异常降雪之雪人」",
		"里春「四月巫师」",
		"里春「异常落花之魔术使」",	
		"「里·Breeze Cherry Blossom」",
		"「里·Perfect Summer Ice」",
		"「里·Crazy Fall Wind」",
		"「里·Extreme Winter」",

		"鼓舞「强力助威」",
		"狂舞「疯狂的背景舞」",
		"弹舞「双目台风」",

		"秘仪「逆向呼神者」",
		"秘仪「背叛的后方射击」",
		"秘仪「弹幕的玉茧」",
		"秘仪「秽那之火」",
		"秘仪「后户的狂言」",
		"秘仪「摩多罗苦谛」",
		"秘仪「七星之剑」",
		"秘仪「无纽带的艺人」",
		"「背面的暗黑猿乐」",
		"「无秩序弹幕地狱」"
	};
}
