package com.meng.gameData.TouHou.zun;

public class TH10GameData
{
	public static final String gameName="东方风神录 ~ Mountain of Faith.";
	public static final String gameNameCN="东方风神录";
	public static final String gameNameAbbr="MoF";
	public static String[] pl10 = new String[]{"博丽灵梦 诱导装备", "博丽灵梦 前方集中装备", "博丽灵梦 封印装备", "雾雨魔理沙 高威力装备", "雾雨魔理沙 贯通装备", "雾雨魔理沙 魔法使装备"};
	public static String[] musicName=new String[]{
		"被封印的众神",
		"眷爱众生之神 ~ Romantic Fall",
		"受稻田公主的斥责啦",
		"厄神降临之路 ~ Dark Road",
		"命运的阴暗面",
		"众神眷恋的幻想乡",
		"芥川龙之介的河童 ~ Candid Friend",
		"Fall of Fall ~ 秋意渐浓之瀑",
		"妖怪之山 ~ Mysterious Mountain",
		"少女曾见的日本原风景",
		"信仰是为了虚幻之人",
		"御柱的墓场 ~ Grave of Being",
		"神圣庄严的古战场 ~ Suwa Foughten Field",
		"明日之盛,昨日之俗",
		"Native Faith",
		"山脚的神社",
		"神明降下恩惠之雨 ~ Sylphid",
		"Player's Score"	
	};
	public static String[] spells=new String[]{
		"叶符「狂舞的落叶」",

		"秋符「秋季的天空」",
		"秋符「无常秋日与少女的心」",
		"丰符「大年收获者」",
		"丰收「谷物神的允诺」",

		"厄符「厄运」",
		"厄符「厄神大人的生理节律」",
		"疵符「破裂的护符」",
		"疵痕「损坏的护身符」",
		"恶灵「厄运之轮」",
		"悲运「大钟婆之火」",
		"创符「痛苦之流」",
		"创符「流刑人偶」",

		"光学「光学迷彩」",
		"光学「水迷彩」",
		"洪水「泥浆泛滥」",
		"洪水「冲积梦魇」",
		"漂溺「粼粼水底之心伤」",
		"水符「河童之河口浪潮」",
		"水符「河童之山洪暴发」",
		"水符「河童之幻想大瀑布」",
		"河童「妖怪黄瓜」",
		"河童「延展手臂」",
		"河童「回转顶板」",

		"岐符「天之八衢」",
		"岐符「猿田彦神之岔路」",
		"风神「风神木叶隐身术」",
		"风神「天狗颪」",
		"风神「二百十日」",
		"「幻想风靡」",
		"「无双风神」",
		"塞符「山神渡御」",
		"塞符「天孙降临」",
		"塞符「天上天下的照国」",

		"秘术「灰色奇术」",
		"秘术「遗忘之祭仪」",
		"秘术「一脉相传的弹幕」",
		"奇迹「白昼的客星」",
		"奇迹「客星璀璨之夜」",
		"奇迹「客星辉煌之夜」",
		"开海「割海成路之日」",
		"开海「摩西之奇迹」",
		"准备「呼唤神风的星之仪式」",
		"准备「召请建御名方神」",
		"奇迹「神之风」",
		"大奇迹「八坂之神风」",

		"神祭「扩展御柱」",
		"奇祭「目处梃子乱舞」",	
		"筒粥「神の粥」",
		"忘谷「遗忘之谷」",
		"神谷「神谕之谷」",
		"贽符「御射山御狩神事」",
		"神秘「葛泉清水」",
		"神秘「大和茅环」",	
		"天流「天水奇迹」",
		"天龙「雨之源泉」",
		"「信仰之山」",
		"「风神之神德」",

		"神符「如水眼之美丽源泉」",
		"神符「结于杉木之古缘」",
		"神符「神所踏足之御神渡」",

		"开宴「二拜二拍一拜」",
		"土著神「手长足长大人」",
		"神具「洩矢的铁轮」",
		"源符「厌川的翡翠」",
		"蛙狩「蛙以口鸣，方致蛇祸」",
		"土著神「七石七木」",
		"土著神「小小青蛙不输风雨」",
		"土著神「宝永四年的赤蛙」",
		"「诹访大战 ~ 土著神话 vs 中央神话」",
		"祟符「洩矢大人」"	
	};
}
