package com.meng.gameData.TouHou.zun;

public class TH11GameData {
	public static final String gameName="东方";
	public static final String gameNameCN="东方";
	public static final String gameNameAbbr="touhou";
	public static String[] players = new String[]{ };
	public static String[] charaName=new String[]{

	};
	public static String[] musicName=new String[]{
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"11111",
		"Player's Score"	
	};
	public static String[] spells=new String[]{
		"怪奇「钓瓶落之怪」",

		"罠符「捕捉之网」",
		"蜘蛛「石窟的蜘蛛巢」",
		"瘴符「瘴气场」",
		"瘴气「原因不明的热病」",

		"妒符「绿眼怪兽」",
		"嫉妒「看不见的绿眼怪兽」",
		"开花爷爷「对华丽的仁者之嫉妒」",
		"开花爷爷「小白的灰烬」",
		"剪舌麻雀「对谦虚的富者之记恨」",
		"剪舌麻雀「大葛笼与小葛笼」",
		"恨符「丑时参拜」",
		"恨符「丑时参拜第七日」",

		"鬼符「怪力乱神」",
		"怪轮「地狱之苦轮」",
		"枷符「罪人不释之枷」",
		"力业「大江山岚」",
		"力业「大江山颪」",
		"四天王奥义「三步必杀」",

		"想起「恐怖的回忆」",
		"想起「恐怖催眠术」",
		"想起「二重黑死蝶」",
		"想起「飞行虫之巢」",
		"想起「波与粒的境界」",
		"想起「户隐山之投」",
		"想起「百万鬼夜行」",
		"想起「蒙蒙迷雾」",
		"想起「风神木叶隐身术」",
		"想起「天狗巨暴流」",
		"想起「鸟居旋风」",
		"想起「春之京人偶」",
		"想起「稻草人敢死队」",
		"想起「回归虚无」",
		"想起「水银之毒」",
		"想起「水精公主」",
		"想起「贤者之石」",
		"想起「延展手臂」",
		"想起「河童之河口浪潮」",
		"想起「粼粼水底之心伤」",

		"猫符「猫的步伐」",
		"猫符「怨灵猫乱步」",
		"咒精「僵尸妖精」",
		"咒精「怨灵凭依妖精」",
		"恨灵「脾脏蛀食者」",
		"尸灵「食人怨灵」",
		"赎罪「旧地狱的针山」",
		"赎罪「古时之针与痛楚的怨灵」",
		"「死灰复燃」",
		"「小恶灵复活」",

		"妖怪「火焰的车轮」",

		"核热「核聚变」",
		"核热「核功率骤增」",
		"核热「核反应失控」",
		"爆符「小型耀斑」",
		"爆符「百万耀斑」",
		"爆符「十亿耀斑」",
		"爆符「千兆耀斑」",
		"焰星「恒星」",
		"焰星「行星公转」",
		"焰星「十凶星」",
		"「地狱极乐熔毁」",
		"「地狱的托卡马克」",
		"「地狱的人工太阳」",
		"「地底太阳」",

		"秘法「九字切」",
		"奇迹「神秘果」",
		"神德「五谷丰穰米之浴」",

		"表象「先祖托梦」",
		"表象「弹幕偏执症」",
		"本能「本我的解放」",
		"抑制「超我」",
		"反应「妖怪测谎机」",
		"潜意识「弹幕的墨迹测验」",
		"复燃「恋爱的埋火」",
		"深层「潜意识的基因」",
		"「被厌恶者的哲学」",
		"「Subterranean Rose」"
	};
}
