package com.meng.gameData.TouHou.zun;

public class TH15GameData {
	public static final String gameName="东方绀珠传 ~ Legacy of Lunatic Kingdom.";
	public static final String gameNameCN="东方绀珠传";
	public static final String gameNameAbbr="LoLK";
	public static String[] players = new String[]{"博丽灵梦", "雾雨魔理沙", "东风谷早苗", "铃仙·优昙华院·因幡"};
	public static String[] musicName=new String[]{
		"宇宙巫女现身",
		"忘不了,那曾依藉的绿意",
		"兔已着陆",
		"湖上倒映着洁净的月光",
		"九月的南瓜",
		"飞翔于宇宙的不可思议巫女",
		"永远的春梦",
		"冻结的永远之都",
		"逆转的命运之轮",
		"遥遥38万公里的航程",
		"星条旗的小丑",
		"故乡之星倒映之海",
		"Pure Furies ~ 心之所在",
		"前所未见的噩梦世界",
		"Pandemonic Planet",
		"从神社所见之月",
		"宇宙巫女归还",
		"Player's Score"	
	};
	public static String[] spells=new String[]{
		"凶弹「高速撞击」",
		"弹符「射鹰」",
		"弹符「鹰已击中」",
		"铳符「月狂之枪」",

		"兔符「草莓团子」",
		"兔符「浆果浆果团子」",
		"兔符「团子影响力」",
		"月见「九月的满月」",
		"月见酒「月狂的九月」",

		"梦符「绯红色的噩梦」",
		"梦符「绯红色的压迫噩梦」",
		"梦符「蔚蓝色的愁梦」",
		"梦符「蔚蓝色的愁三重梦」",
		"梦符「愁永远之梦」",
		"梦符「刈安色的迷梦」",
		"梦符「刈安色的错综迷梦」",
		"梦符「捕梦网」",
		"梦符「苍蓝色的捕梦网」",
		"梦符「梦我梦中」",
		"月符「绀色的狂梦」",

		"玉符「乌合之咒」",
		"玉符「乌合的逆咒」",
		"玉符「乌合的二重咒」",
		"玉符「秽身探知型水雷」",
		"玉符「秽身探知型水雷 改」",
		"玉符「众神的弹冠」",
		"玉符「众神的光辉弹冠」",
		"「孤翼的白鹭」",

		"狱符「地狱日食」",
		"狱符「地狱之蚀」",
		"狱符「闪光与条纹」",
		"狱符「星与条纹」",
		"狱炎「擦弹地狱火」",
		"狱炎「擦弹的狱意」",
		"地狱「条纹状的深渊」",
		"「伪阿波罗」",
		"「阿波罗捏造说」",

		"「掌上的纯光」",
		"「杀意的百合」",
		"「现代的神灵界」",
		"「原始的神灵界」",
		"「战栗的寒冷之星」",
		"「纯粹的疯狂」",
		"「溢出的暇秽」",
		"「地上秽的纯化」",
		"纯符「单纯的子弹地狱」",
		"纯符「纯粹的弹幕地狱」",

		"蝴蝶「取而代之的蝴蝶」",
		"超特急「梦幻快车」",
		"爬梦「爬行的子弹」",

		"异界「逢魔之刻」",
		"地球「邪秽在身」",
		"月「阿波罗反射镜」",
		"「用于杀人的纯粹弹幕」",
		"异界「地狱的非理想弹幕」",
		"地球「落向地狱的雨」",
		"「用于逼死瓮中鼠的单纯弹幕」",
		"月「月狂冲击」",
		"「三位一体论狂想曲」",	
		"「最初与最后的无名弹幕」"
	};
}
